# Explain

The **SQL FULL JOIN** combines the results of both left and right outer joins.

The joined table will contain all records from both the tables and fill in NULLs for missing matches on either side.

**Syntax**

The basic syntax of a **FULL JOIN** is as follows.

```sql
SELECT table1.column1, table2.column2...
FROM table1
FULL JOIN table2
ON table1.common_field = table2.common_field;
```

![](../images/full-join-trong-sql.png)

# Example

## create db

In [3]:
%%bash
../scripts/create_db_server.sh

my-postgresql
fc5f97a12d0881308346de9c2db3cd285949420376df74474f55f038b6c899cb

Connection to localhost 5432 port [tcp/postgresql] succeeded!

Created db server

## load sql extension and connect db

In [4]:
%load_ext sql
%sql postgresql://postgres:password123@localhost/dvdrental

## create CUSTOMERS table

In [5]:
%%sql

CREATE TABLE IF NOT EXISTS CUSTOMERS (
   ID   INT              NOT NULL,
   NAME VARCHAR (20)     NOT NULL,
   AGE  INT              NOT NULL,
   ADDRESS  CHAR (25),
   SALARY   DECIMAL (18, 2),
   PRIMARY KEY (ID)
);

INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (1, 'Ha Anh', 32, 'Da Nang', 2000.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (2, 'Van Ha', 25, 'Ha Noi', 1500.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (3, 'Vu Bang', 23, 'Vinh', 2000.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (4, 'Thu Minh', 25, 'Ha Noi', 6500.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (5, 'Hai An', 27, 'Ha Noi', 8500.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (6, 'Hoang', 22, 'Ha Noi', 4500.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (7, 'Binh', 24, 'Ha Noi', 10000.00 ) ON CONFLICT DO NOTHING;

SELECT * FROM CUSTOMERS;

 * postgresql://postgres:***@localhost/dvdrental
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
7 rows affected.

[(1, 'Ha Anh', 32, 'Da Nang                  ', Decimal('2000.00')),
 (2, 'Van Ha', 25, 'Ha Noi                   ', Decimal('1500.00')),
 (3, 'Vu Bang', 23, 'Vinh                     ', Decimal('2000.00')),
 (4, 'Thu Minh', 25, 'Ha Noi                   ', Decimal('6500.00')),
 (5, 'Hai An', 27, 'Ha Noi                   ', Decimal('8500.00')),
 (6, 'Hoang', 22, 'Ha Noi                   ', Decimal('4500.00')),
 (7, 'Binh', 24, 'Ha Noi                   ', Decimal('10000.00'))]

## create ORDERS table

In [6]:
%%sql

CREATE TABLE IF NOT EXISTS ORDERS (
   OID  INT              NOT NULL,
   DATE VARCHAR (20)     NOT NULL,
   CUSTOMER_ID INT       NOT NULL,
   AMOUNT INT,
   PRIMARY KEY (OID)
);

INSERT INTO ORDERS (OID, DATE, CUSTOMER_ID, AMOUNT)
    VALUES (102, '2009-10-08 00:00:00', 3, 10) ON CONFLICT DO NOTHING;
INSERT INTO ORDERS (OID, DATE, CUSTOMER_ID, AMOUNT)
    VALUES (100, '2009-10-08 00:00:00', 8, 15) ON CONFLICT DO NOTHING;
INSERT INTO ORDERS (OID, DATE, CUSTOMER_ID, AMOUNT)
    VALUES (101, '2009-11-20 00:00:00', 9, 5) ON CONFLICT DO NOTHING;
INSERT INTO ORDERS (OID, DATE, CUSTOMER_ID, AMOUNT)
    VALUES (103, '2008-05-20 00:00:00', 4, 20) ON CONFLICT DO NOTHING;

SELECT CUSTOMER_ID, AMOUNT, DATE
FROM ORDERS
ORDER BY CUSTOMER_ID;

 * postgresql://postgres:***@localhost/dvdrental
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
4 rows affected.

[(3, 10, '2009-10-08 00:00:00'),
 (4, 20, '2008-05-20 00:00:00'),
 (8, 15, '2009-10-08 00:00:00'),
 (9, 5, '2009-11-20 00:00:00')]

## do FULL JOIN

In [17]:
%%sql

-- SELECT  c.ID, c.NAME, o.AMOUNT, o.DATE
--     FROM CUSTOMERS c
--     FULL JOIN ORDERS o
--     ON c.ID = o.CUSTOMER_ID
--     ORDER BY c.ID

SELECT  ID, NAME, AMOUNT, DATE
   FROM CUSTOMERS
   FULL JOIN ORDERS
   ON CUSTOMERS.ID = ORDERS.CUSTOMER_ID
    ORDER BY ID

 * postgresql://postgres:***@localhost/dvdrental
9 rows affected.

[(1, 'Ha Anh', None, None),
 (2, 'Van Ha', None, None),
 (3, 'Vu Bang', 10, '2009-10-08 00:00:00'),
 (4, 'Thu Minh', 20, '2008-05-20 00:00:00'),
 (5, 'Hai An', None, None),
 (6, 'Hoang', None, None),
 (7, 'Binh', None, None),
 (None, None, 5, '2009-11-20 00:00:00'),
 (None, None, 15, '2009-10-08 00:00:00')]

**NOTE:** If your Database does not support **FULL JOIN** (MySQL does not support **FULL JOIN**), then you can use **UNION ALL** clause to combine these two JOINS as shown below.

In [25]:
%%sql

SELECT * FROM (
   SELECT  ID, NAME, AMOUNT, DATE
      FROM CUSTOMERS left_table
      LEFT JOIN ORDERS right_table
      ON left_table.ID = right_table.CUSTOMER_ID
   UNION ALL
      SELECT  ID, NAME, AMOUNT, DATE
      FROM CUSTOMERS left_table
      RIGHT JOIN ORDERS right_table
      ON left_table.ID = right_table.CUSTOMER_ID
) temp_table
ORDER BY ID

-- SELECT * FROM (
--    SELECT  ID, NAME, AMOUNT, DATE
--    FROM CUSTOMERS
--    LEFT JOIN ORDERS
--    ON CUSTOMERS.ID = ORDERS.CUSTOMER_ID
-- UNION ALL
--    SELECT  ID, NAME, AMOUNT, DATE
--    FROM CUSTOMERS
--    RIGHT JOIN ORDERS
--    ON CUSTOMERS.ID = ORDERS.CUSTOMER_ID
-- ) temp_table
-- ORDER BY ID

-- reference: https://stackoverflow.com/a/72041434/7639845

 * postgresql://postgres:***@localhost/dvdrental
11 rows affected.

[(1, 'Ha Anh', None, None),
 (2, 'Van Ha', None, None),
 (3, 'Vu Bang', 10, '2009-10-08 00:00:00'),
 (3, 'Vu Bang', 10, '2009-10-08 00:00:00'),
 (4, 'Thu Minh', 20, '2008-05-20 00:00:00'),
 (4, 'Thu Minh', 20, '2008-05-20 00:00:00'),
 (5, 'Hai An', None, None),
 (6, 'Hoang', None, None),
 (7, 'Binh', None, None),
 (None, None, 15, '2009-10-08 00:00:00'),
 (None, None, 5, '2009-11-20 00:00:00')]